In [3]:
import pandas as pd
from IPython.display import display 
import numpy as np

In [4]:
students_performance = pd.read_csv('data_stepic/StudentsPerformance.csv', sep=',')
display(students_performance)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [5]:
students_performance.iloc[[3, 6, 10], [2, 4, -1]]

   parental level of education test preparation course  writing score
3           associate's degree                    none             44
6                 some college               completed             92
10          associate's degree                    none             52

In [5]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]
# создадим маленький DF
display(students_performance_with_names)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [6]:
# присвоим индексам имена
students_performance_with_names.index = \
    ['Sercei', 'Tywin', 'Gregor', 'Joffrey', 'Ilyn Payne']
display(students_performance_with_names)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Sercei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [16]:
students_performance_with_names.loc[['Sercei', 'Joffrey']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Sercei,female,group B,bachelor's degree,standard,none,72,72,74
Joffrey,male,group B,some college,free/reduced,none,40,43,39

In [17]:
students_performance_with_names.loc[['Sercei', 'Joffrey'], ['gender', 'writing score']]

         gender  writing score
Sercei   female             74
Joffrey    male             39

# Важный момент

In [5]:
students_performance_with_names.iloc[:, 0]

0    female
3      male
4      male
7      male
8      male
Name: gender, dtype: object

In [6]:
# определим тип этой колонки
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [10]:
# создадим свои серии
my_series_1 = pd.Series([1, 2, 3], index=['Sercei', 'Tywin', 'Gregor'])
my_series_2 = pd.Series([4, 5, 6], index=['Sercei', 'Tywin', 'Gregor'])
display(my_series_1)
display(my_series_2)

Sercei    1
Tywin     2
Gregor    3
dtype: int64

Sercei    4
Tywin     5
Gregor    6
dtype: int64

In [11]:
# соберем DataFrame из Series
pd.DataFrame({'col_name_1':my_series_1, 'col_name_2':my_series_2})

        col_name_1  col_name_2
Sercei           1           4
Tywin            2           5
Gregor           3           6

In [7]:
students_performance_with_names['gender'].shape
# обратились к значениям столбцм, получили Series

(5,)

In [8]:
students_performance_with_names[['gender']].shape
# обратились ко всему DF, получили DF

(5, 1)